{
  "articles": [
    {
      "data": "Iran’s Revolutionary Guard, IRGC, “is a menace to the world,” the US State Department spokesperson told reporters on Thursday, when asked about European efforts to designate it as a terrorist organization. Vedant Patel was asked during the daily briefing about reports that Germany and other EU countries are trying to persuade the European Union to designate the IRGC as a terrorist entity. Patel responded: “Well, let me just say unequivocally that the IRGC is a menace to the world. We absolutely support efforts to designate the IRGC a terrorist organization, and we support those efforts worldwide. As you know, this is something that the United States has done, already designating the IRGC, and it is a terrible purveyor of terrorism that we believe affects the entire world.” The US designated the IRGC in 2019, during the Trump administration, while in 2022 there were reports that the Biden White House might lift that designation, during negotiations with Iran to revive the 2015 JCPOA nuclear deal. It was reported in April 2022 that President Joe Biden made a final decision to maintain the status quo and informed Israeli Prime Minister Benjamin Netanyahu, who was concerned about lifting the designation. Since then, the administration has imposed many sanctions on IRGC-affiliated individuals and entities involved in Tehran’s missile and drone proliferation as well as money laundering and other activities in support of groups in the region that have also been designated as terrorist, such as the Lebanese Hezbollah and Yemen’s Houthis. However, critics say that the administration has not vigorously enforced oil export sanctions on Iran, allowing the Islamic Republic to earn tens of billions of dollars with shipments to China. Despite the Biden administration’s three-year-long efforts to restore the JCPOA, abandoned by former President Donald Trump, Iran has refused to make a deal, and has increased its uranium enrichment, stockpiling enough fissile material for several nuclear bombs. In recent weeks, Iranian officials have also threatened to shift their nuclear doctrine – an implicit threat to produce warheads. Reports in the past week have indicated that France, Germany and Britian, signatories of the JCPOA, intend to field a censure resolution against Iran at the upcoming board meeting of the International Atomic Energy Agency (IAEA). Unconfirmed reports have suggested that the Biden administration opposes such a censure, as it still holds secret talks with Tehran. Patel was asked about these reports during the Thursday briefing. His response indicated that there are still unresolved issues but insisted there is coordination with allies. “We’re continuing to remain tightly coordinated on this with our E3 partners,” he said adding that “No decisions have been taken with respect to any particular upcoming Board of Governors meetings, but I will just say is that we, the United States, are actively increasing pressure on Iran through a combination of sanctions, deterrence, and international isolation.”"
    },
    {
      "data": "ULU TIRAM, JOHOR – Dilapidated houses with broken windows, a run-down badminton court, an abandoned car with four flat tyres and a sign warning trespassers to keep out are grim remnants of a former terrorist compound in Kampung Sungai Tiram in the Malaysian state of Johor. For the better part of the last decade, residents of this village, just 20km to the north-east of state capital Johor Bahru, have gone about their daily lives in peace, putting memories of the Jemaah Islamiyah (JI) militant group behind them. But an attack nearby last week, in which two policemen were killed, has revived their old fears. At 2.45am on May 17, the 21-year-old son of a former JI member entered the Ulu Tiram police station and killed an officer with a parang. He grabbed the victim’s sidearm and opened fire on two other police officers, killing one and injuring the other. The injured officer then shot dead the assailant. “I thought all these (terror attacks) were over. When I found out about the killings, I was shocked and terrified,” a 30-year-old civil servant, who wanted to be known only as Ms Amal, told The Straits Times. Her house is about 600m from the entrance to the former terrorist commune. Fearing for her safety, Ms Amal spoke to ST from behind her closed front door. The compound, which sits on a plot of about 2ha surrounded by oil palm trees, is secluded and accessible only via a narrow road. The cluster of 10 or so houses once sheltered Asia’s most wanted terrorist – JI bomb-maker Noordin Mohamad Top – and others, who were instrumental in the 2002 Bali bombings that killed 202 people and injured 209. JI carried out other attacks, including the 2003 JW Marriott bombing in Jakarta, the 2004 Australian embassy bombing in Jakarta, the 2005 Bali bombings and the 2009 Jakarta bombings. Its final terror strike took place on Sept 16, 2014, with the bombing of the Rizal Park Monument in the Philippines, which killed one person and injured seven others. The movement was officially founded by Indonesians Abu Bakar Bashir and Abdullah Sungkar in Malaysia in 1993. The duo were hiding in the country to escape being hunted down by then President Suharto’s government. They opened the now defunct Luqmanul Hakim religious school in the compound, where it was believed they received funds for their terror activities through the students and their parents before the school’s closure by the Malaysian government in 2001. The school, or madrasah, doubled as a meeting place for the group’s operatives, including Singapore JI leaders Mas Selamat Kastari and Ibrahim Maidin. Mas Selamat fled to the commune after he escaped from a detention centre in Singapore in 2008, sparking a nationwide manhunt. He is currently detained in Singapore under the Internal Security Act. One of the masterminds of the 2002 Bali bombings, Riduan Isamuddin, known as Hambali, was believed to have met his wife, Noralwizah Lee Abdullah, at the same madrasah. He is currently detained in Guantanamo Bay, Cuba. Noordin, who was a JI strategist and taught at the madrasah, was killed in an Indonesian police raid in September 2009. Village head Muhamad Mohmed Som, a Kampung Sungai Tiram native, said the JI members largely kept to themselves and did not cause any trouble. He noted that they remained anonymous even as they shopped for groceries in a small place of roughly 7,000 people. “Who would want to cause trouble in the same place that they live in? We knew that they were JI only after the bombings and when the police subsequently raided the compound,” he said, referring to the Bali bombings of 2002. “This new attack is definitely shocking. We thought they had become peaceful,” said Mr Muhamad, 65, a retired army corporal. Home Minister Saifuddin Nasution has called last week’s attack an isolated “lone wolf” incident, and said the assailant, who has not been identified, was not linked to JI, despite the authorities originally believing that he was. Five members of his family are still in police custody. When ST visited the commune on May 19, there were a handful of police vehicles and a troop of personnel still conducting investigations. While there are still people living there, no resident was visible on the grounds. An officer armed with a sub-machine gun guarded the area, with plain-clothes officers milling about, while a balaclava-clad officer warned ST journalists not to return under the threat of arrest. JI, which is affiliated with Al-Qaeda, the terror group responsible for the 9/11 attacks in the US, is outlawed in Malaysia and Indonesia. The Indonesian authorities will arrest any member of the group, even though they have not participated in any terror activities, while the Malaysian authorities continue to monitor former members and ex-detainees. “I was told by my police officer friend that the police have always monitored that compound. The group have gone through re-education, and the authorities would visit them a few times a year – at least twice a year,” said retired army corporal Shaharin Dakeron. “That community never mingled with us and kept to themselves. I think their children are home-schooled,” said the 76-year-old villager. He noted that even at the height of JI’s terrorist activities from 2002 to 2014, the group had never caused any trouble to the locals. Nevertheless, the May 17 attack at the Ulu Tiram police station has created ripples that have spread beyond Malaysia’s shores. On May 20, the Johor Islamic Religious Council said the remains of the killer had to be buried away from the graves of civilians as a sign of condemnation. The state religious authority is considering demolishing the abandoned Luqmanul Hakim religious school, even though it is no longer in operation. Meanwhile, Singapore Prime Minister Lawrence Wong said on May 21 that the attack on the three Malaysian policemen is a grim reminder that the threat of terrorism remains high. In a Facebook post, he told Singaporeans to be vigilant against such extremist ideology finding resonance in the country, as the ongoing conflict in the Middle East has been used by global terrorist elements to “peddle their radical rhetoric and incite calls for violence”. Singapore has also tightened its security measures, including at checkpoints, following the attack. Mr Andrin Raj, a director with the Nordic Counter Terrorism Network, told ST previously that JI has always been a serious concern in the region, and its threat has never been fully neutralised. “Islamist groups and jihadists have seen the region to be a ‘safe haven’ for establishing a regional caliphate. The threat of terrorism in Malaysia is not a resurgence. The rise of radicalism in Malaysia has been ongoing for decades,” he said."
    },
    {
      "data": "ISIS has claimed responsibility for an attack at a popular concert hall complex near Moscow Friday after assailants stormed the venue with guns and incendiary devices, killing at least 60 people and injuring 145. The terror group took responsibility for the attack in a short statement published by ISIS-affiliated news agency Amaq on Telegram on Friday. It did not provide evidence to support the claim. Video footage from the Crocus City Hall shows the vast complex, which is home to both the music hall and a shopping center, on fire with smoke billowing into the air. State-run RIA Novosti reported the armed individuals “opened fire with automatic weapons” and “threw a grenade or an incendiary bomb, which started a fire.” They then “allegedly fled in a white Renault car,” the news agency said. State media Russia 24 reported the roof of the venue has partially collapsed. The fire had been brought largely under control more than six hours later. “There are still some pockets of fire, but the fire has been mostly eliminated,” Moscow governor Andrey Vorobyov said on Telegram. The deadliest terror attack on Moscow in decades, Friday’s assault came less than a week after President Vladimir Putin won a stage-managed election by an overwhelming majority to secure another term in office, tightening his grip on the country he has ruled since the turn of the century. With attention focused on the country’s war with neighboring Ukraine, Putin had trumpeted a message of national security before Russians went to the polls. The carnage broke out before a concert by the band Picnic, according to Russia 24. “Unidentified people in camouflage broke into Crocus City Hall and started shooting before the start of the concert,” the Prosecutor General’s Office said, cited by TASS. Video footage showed panic as the attack unfolded, with crowds of people huddling together, screaming and ducking behind cushioned seats as gunshots started echoing in the vast hall. One group sheltering next to a large wall of windows outside the concert venue were forced to break them to escape the gunfire, video obtained by CNN shows. Footage geolocated by CNN shows an armed individual starting at least one fire inside the venue. The individual is seen carrying something in their hand and, as they walk off-screen, a bright flash of light from a large flame is seen in the video. A SWAT team was called to the area and more than 70 ambulance teams and doctors assisted victims. One hundred and forty-five people have been hospitalized, TASS reported. Sixty people are in a “serious condition.” According to the Kremlin, Putin was informed about the attack and is being kept updated on measures on the ground. The president on Saturday wished those injured in the attack a speedy recovery, the state-run RIA-Novosti news agency said. He also “conveyed his gratitude to the doctors,” RIA added. Around 100 people were evacuated from the building by firefighters, TASS reported. Moscow Mayor Sergei Sobyanin called the attack a “terrible tragedy.” “My condolences to the loved ones of the victims. I gave orders to provide all necessary assistance to everyone who suffered during the incident,” Sobyanin said in a statement. Sobyanin said on Telegram that he was canceling all sports, cultural and other public events in Moscow this weekend. Picnic’s manager told state media that the performers were unharmed. Russian singer Shaman said he would pay for the funerals of the victims and treatment for those injured. “We are all one big family. And in a family there is no such thing as somebody else’s grief,” the singer, known for his nationalistic views, said in a video posted on the Russian social media network Vkontakte to his more than 600,000 followers. “My people, any troubles and misfortunes have always united our country. They have made Russia tougher and stronger. It will not be possible to frighten and break us this time either.”"
    },
    {
      "data": "Two Israeli soldiers have died after being seriously wounded in a terrorist vehicular assault near the city of Nablus (Shechem) in Samaria on Wednesday night, the Israel Defense Forces said on Thursday morning, They were identified as Staff Sgt. Eliya Hilel, 20, from Tel Zion, and Staff Sgt. Diego Shvisha Harsaj, 20, from Tel Aviv. Both belonged to the Kfir Brigade’s Nahshon Battalion. Separately, the IDF announced the death of Staff Sgt. Yedidya Azugi, 21, from Revava in Samaria, who was killed in battle in the northern Gaza Strip. Azugi was a soldier in the Paratrooper Brigade’s 101st Battalion. Their deaths bring the IDF’s death toll on all fronts since the start of the war on Oct. 7 to 642; Azugi’s death raises the death toll in Gaza since the start of the Gaza ground invasion on Oct. 27 to 291. Gen. Yehuda Fox, head of the IDF’s Central Command, conducted a situational assessment at the scene of the Samaria attack on Thursday morning. He was joined by commanders and soldiers operating in the area. On Wednesday night, IDF Chief of Staff Lt. Gen. Herzi Halevi was at the scene of the attack for an initial inquiry and initial assessment. The terrorist managed to escape and flee towards Nablus, before turning himself in to Palestinian Authority police, the Kan News public broadcaster reported, adding that he had yet to be transferred to IDF custody. According to the Hatzalah Judea and Samaria (Rescuers Without Borders) emergency response group, the attack took place between the Hatmar Shomron Junction and the Israeli community of Itamar. Following the attack, Samaria Regional Council head Yossi Dagan demanded that the IDF restore security checkpoints and roadblocks near Palestinian terrorist hotspots like Nablus. ‘Terrorism must be eradicated everywhere’ “It can’t be that an attacker is able to appear from and then return to the Palestinian Authority without hindrance,” said Dagan according to Israel’s Channel 12 News. Earlier on Wednesday, Israeli Finance Minister Bezalel Smotrich urged immediate government action after Palestinian terrorists fired on central Israel from northern Samaria for the second time this week. “Terrorism must be eradicated everywhere, even if it means Tulkarem [in Samaria] will look like Gaza looks today,” tweeted Smotrich, who oversees civilian issues in Judea and Samaria in the Defense Ministry. Judea and Samaria saw a dramatic rise in Palestinian terrorist attacks in 2023 compared to the previous year, with shootings reaching their highest level since the Second Intifada of 2000-05, per IDF data. Between Oct. 7 and Jan. 15, Rescuers Without Borders first responders recorded more than 2,600 Palestinian attacks targeting Israelis in Judea and Samaria, including 760 cases of rock-throwing, 551 fire bombings, 12 attempted or successful stabbings and nine vehicular assaults."
    },
    {
      "data": "Pakistan on Sunday demanded that Afghanistan take \"action\" against the terror group Tehreek-e-Taliban Pakistan (TTP), including its so-called leader, for its role in recent terrorist attacks in the country, including a suicide bombing of a vehicle carrying Chinese nationals in the northwestern province. \"We demand that the interim Taliban government arrest the TTP leaders, including its chief, Noor Wali Mehsud and hand them over to Pakistan in order to maintain friendly relations between the two countries,\" Interior Minister Mohsin Naqvi told a press conference in the northeastern city of Lahore, along with senior security officials. Islamabad has long accused Kabul of failing to take action against TTP militants who allegedly hide and operate from Afghanistan. Kabul denies the accusations. \"We have requested the interim Taliban government to take action against the TTP leaders who have been planning and executing terrorist attacks from Afghanistan. But, unfortunately, nothing has been done from their (Taliban) side,\" Naqvi said. \"Pakistan wants good relations with Afghanistan but it cannot happen at the cost of terrorism inside Pakistan,\" he added. Naqvi said 11 alleged militants were arrested in connection with the March suicide attack on a convoy of Chinese workers in Khyber Pakhtunkhwa's Shangla district. Five Chinese nationals who were working on a power project and a Pakistani were killed in the terrorist attack. Naqvi claimed that the attack was \"planned and executed\" from Afghanistan. \"Terrorists (in custody) have confessed that they and the suicide bomber were trained in Afghanistan,\" he charged. Pakistan has seen an uptick in terrorist attacks since the Taliban returned to power in Kabul in August 2021."
    },
    {
      "data": "Australian police have declared Monday's stabbing at a Sydney church a religiously motivated \"terrorist act\". A 16-year-old boy was arrested after a bishop, a priest and churchgoers were attacked during mass at the Assyrian Christ The Good Shepherd Church. At least four people suffered \"non-life-threatening\" injuries, police say. The attacker was also hurt. The incident was captured on a church livestream and quickly triggered unrest in the suburb of Wakeley. Australian police define terror offences as being ideologically motivated. Investigations are still under way, but they say they are satisfied this is a case of religious extremism. Authorities have repeatedly declined to state the religion of the alleged attacker. The church has named the priest as Father Isaac Royel and the bishop as Mar Mari Emmanuel. Ordained in 2011, Bishop Emmanuel is seen as a popular and controversial figure, whose sermons receive millions of views on social media. When graphic videos of the attack - and the aftermath - spread like wildfire online on Monday night, they drew an angry crowd to the Assyrian Orthodox Church, which is about 35km south-west of the city centre. There, hundreds of people upset over the attack violently clashed with police, who were guarding the church where the alleged attacker was being held. Two officers were injured - one suffering a broken jaw after he was hit with a brick and fence palings - and 10 police cars destroyed. The violence similarly left paramedics fearing for their safety and \"holed up\" inside the church for more than three hours. Maria, a member of the Assyrian community, told Guardian Australia that those present outside the church following the attack were \"reacting to what they were seeing on social media\". \"There were many inflammatory posts making the rounds, people advocating for violence and such,\" she said. \"It was making lots of people very angry.\" Prime Minister Anthony Albanese has convened an emergency meeting of national security agencies, calling the attack \"disturbing\". \"We're a peace-loving nation... There's no place for violent extremism,\" he said. Trying to quell further violence, he urged that people \"not take the law into their own hands\". Questioned about the role that social media played in Monday night's events, Mr Albanese said he \"remained concerned\" about it. The government has told Meta, the parent company of Facebook, Instagram and Whatsapp - as well as X, formerly known as Twitter - to remove offensive content relating to the attack from their platforms within 24 hours or face potential fines. Speaking to media on Tuesday morning, New South Wales (NSW) Police Commissioner Karen Webb said the bishop and priest were undergoing surgery and were \"lucky to be alive\". Ms Webb said the teenager allegedly made comments to the bishop as he approached, which were \"centred around religion\". Police believe that staging the attack during a livestreamed service was intended to be \"intimidating not only [to] the parishioners in attendance, but those parishioners who were watching online\". She said the suspect was acting alone. While \"known to police\", he was not on any terror watch list. During an interview with 2GB radio, state premier Chris Minns later confirmed reports that the teenager had previous knife crime charges and had been found with a blade at school in 2020. The alleged offender has been in surgery after his fingers were injured, police said, adding it is unclear if he was hurt with his own weapon or when he was apprehended by the congregation. The incident came just days after the nation was shocked by a separate and unrelated stabbing at a popular Sydney shopping centre, which left seven people dead. \"NSW is on edge and there's understandable community anxiety at the moment,\" said Mr Minns. He appealed for calm, echoing calls from religious and community leaders. \"Their message to their communities was universal and identical, and that is that they deplore violence in all forms, [and] that they have faith in the NSW Police to undertake their investigation,\" Mr Minns said. Any attempt for \"tit-for-tat\" violence would be \"met by the full force of the law\", he added. A strike force has also been assembled to find those involved in the riot, Ms Webb said: \"We will find you and we will come and arrest you.\" The head of the NSW Ambulance also called the behaviour from crowds \"outrageous\". \"Our people, that do nothing but go to care and help every single day, need to know that they've got the support of the community,\" Dominic Morgan said. Christ The Good Shepherd Church, meanwhile, urged those holding a vigil outside the hospital where Mr Emmanuel is being treated to leave and to \"respect his privacy and the safety of others\". The Wakeley neighbourhood is a hub for Sydney's small Christian Assyrian community, many of whom have fled persecution and war in Iraq and Syria. Bishop Emmanuel is a prominent leader in that community, and is one of the \"kindest, [most] authentic, genuine human beings\", local MP Dai Le said. However, the bishop has had a turbulent relationship with the Assyrian Church, reportedly being suspended for disobeying canons and forming a breakaway church. In 2021, he became a vocal opponent of Covid-19 restrictions, describing lockdowns in Australia as slavery and arguing that vaccines were futile."
    },
    {
      "data": "Gunmen stormed a rock concert near Moscow, killing at least 90 people and wounding more than 100 others, authorities said, in one of the deadliest terror attacks to hit Russia in years. The Islamic State group claimed responsibility for the attack on Friday, and U.S. officials confirmed the claim, according to media reports. Eleven people have been detained in connection with the attack, the head of Russia’s Federal Security Service told Russian President Vladimir Putin on Saturday, according to Russian state news agency Tass. Putin has not publicly addressed the situation yet. Russian state media reported that the assailants fired automatic rifles and tossed what was either a hand grenade or incendiary device toward concert-goers from the main entrance of the venue, Crocus City Hall, ahead of a performance by the Russian band Picnic. The building was set alight during the attack, and images from the scene showed flames and heavy smoke billowing out from the building. Multiple videos circulating online showed concert-goers throwing themselves to the floor, hiding behind seats, or running away in search of an exit to the sounds of gunshots and screaming. One video showed four gunmen making their way toward what looked like an exit, with one stopping to fire repeatedly into a group of people huddled together in a corner. Other images circulating on social media showed what appeared to be the bodies of victims, lying amid piles of shattered glass. News of the attack prompted authorities to evacuate malls in Moscow and St. Petersburg as well as cancel public events across the country, Russian media reported. Moscow Mayor Sergei Sobyanin posted on social media that the attack was a “horrible tragedy,” while Russian Foreign Ministry spokesperson Maria Zakharova called it a “bloody terrorist attack.” It’s unclear who carried out the attack. Ukraine, which has been at war with Russia since the Kremlin launched its full-scale invasion two years ago, denied it was responsible. Mykhailo Podolyak, a spokesperson for Ukrainian President Volodymyr Zelenskyy, said on social media that Ukraine has “nothing to do” with the attack. “Everything in this war will be decided only on the battlefield,” he said. “Terrorist attacks do not solve any problems.” The U.S. Embassy in Moscow on March 7 had warned it was “monitoring reports that extremists have imminent plans to target large gatherings in Moscow, to include concerts.” White House National Security Council spokesperson John Kirby told reporters on Friday that Washington was trying to get more information about the incident, but noted that the “images were just horrible.” “Our thoughts obviously are going to be with the victims of this terrible, terrible shooting attack,” he said. Armenia, Belarus, Bolivia, Cuba, Iran, France, Serbia and Turkey also sent their official condolences."
    },
    {
      "data": "Pakistan has demanded that the Taliban government in Afghanistan hand over terrorists from the outlawed Tehreek-e-Taliban Pakistan (TTP) who were involved in the attack on Chinese engineers in the Shangla district of Khyber Pakhtunkhwa, reported ARY News. The attack, which took place on March 26 in Bisham city of Khyber Pakhtunkhwa’s Shangla district, claimed the lives of five Chinese engineers and one Pakistani citizen. The incident occurred when the convoy was traveling between Islamabad and a hydroelectric dam construction site in Dasu, Khyber Pakhtunkhwa. According to the District Inspector General (DIG) of Malakand, a suicide bomber rammed an explosive-laden vehicle into a convoy carrying Chinese nationals. Addressing a press conference alongside officials from the National Counter-Terrorism Authority (Necta), Interior Minister Mohsin Naqvi stated that Pakistan has raised the issue with the Afghan interim government and urged them to take action against terrorist activities being carried out on their soil. The interior minister added that the TTP orchestrated the Shangla terror attack from inside Afghanistan. “We have requested the interim government in Afghanistan to arrest the leadership of the banned TTP,” he said. Following the attack, Prime Minister Shehbaz Sharif instructed the concerned authorities to conduct a thorough joint investigation into the Shangla suicide attack on Chinese nationals, utilizing all the resources of the state. PM Sharif chaired a high-level emergency meeting after the attack, appreciating the swift response of law enforcement agencies and locals, which saved many lives. On Sunday, while briefing journalists, Interior Minister Naqvi said that the probe agencies have prepared an investigation report, adding that they have concrete evidence that the TTP used Afghan soil to carry out the terror attack on Chinese engineers, reported Al Jazeera. He further said that Pakistan wants friendly ties with Kabul, but it is only possible if they cooperate with Islamabad. Noting the importance of Pakistan-China ties, the interior minister said that Pakistan attaches great importance to its relationship with China, and both friendly nations support each other at different global forums. “The security of Chinese nationals is very important to us,” he said. Meanwhile, National Coordinator NACTA, Rai Tahir, said that investigations into the Bisham attack progressed with the recovery of a mobile phone near the vehicle used in the attack."
    },
    {
      "data": "A man who stabbed a stranger to death in an attack described by a judge as a terrorist act has been jailed for life. Moroccan asylum seeker Ahmed Alid, 45, roamed the streets in Hartlepool looking for a victim to attack in 'revenge' for the Israel-Hamas conflict in October, the judge told Teesside Crown Court. He killed 70-year-old Terence Carney by stabbing him multiple times. Sentencing Alid for life on Friday, the judge said the killer had 'hoped to frighten the British people and undermine the freedoms they enjoy'. He was also found guilty of the attempted murder of his housemate, Javed Nouri. Alid, who was described as following an extreme version of Islam by prosecutors, had told police the attacks were in protest against the Israel and Gaza conflict. He spoke through an Arabic interpreter during the trial and had admitted stabbing the two men but denied he had intended to kill or cause really serious harm. The judge, Mrs Justice Cheema-Grubb, said: 'The murder of Terence Carney was a terrorist act in which you hoped to influence the British government. You intended it as revenge for the actions of a foreign country, Israel, and to intimidate and influence the British government in its international relations. You hoped to frighten the British people and undermine the freedoms they enjoy.' 'No genuine remorse' The judge said psychiatric reports had found no evidence of psychosis 'or any other serious mental illness' in Alid. She said he was deemed to have a 'minor mental illness' called an adjustment disorder which would have affected his judgment but this offered 'very limited mitigation' as it was not sufficiently linked to 'such a serious level of violence'. She told Alid he had shown 'no genuine remorse or pity' for his victims. Due to time spent on remand, he would have to serve 44 years and 52 days in prison, she said. The court heard Alid forced his way into Mr Nouri's room in the early hours of 15 October and stabbed him. Alid shouted 'Allahu Akbar' - 'God is great' - during the attack at the Home Office-approved asylum seekers' accommodation. After that attack, Alid fled into the street and came across Mr Carney, who was out for a regular early morning walk on nearby Raby Road. Mrs Justice Cheema-Grubb said Alid had waited to assault Mr Nouri when he was 'asleep and vulnerable,' and that 'the life he had started to build in this country was shattered by what happened'. She said Alid then 'attacked an unarmed and elderly man who was unable to defend himself'. Doorbell camera footage showed Mr Carney cry out 'no, no' as he was stabbed by the stranger. In a holding cell at Middlesbrough police station after his arrest, Alid launched into a speech in Arabic saying that 'Allah willing, Gaza would return to be an Arab country' and how he would have continued his 'raid' if his hands had not been injured. Alid, who strongly disapproved of his housemate Mr Nouri's conversion to Christianity, said God was 'displeased' with those who went astray. During his police interview Alid said he launched his attacks because 'Israel had killed innocent children'. Jonathan Sandiford KC, prosecuting, told the court during the trial: 'In other words, he said he had committed the attempted murder of Javed Nouri and the murder of Mr Carney in revenge for what he believed to be the killing of children by Israel.' 'I don't feel anything' In a victim statement, Mr Carney’s wife Patricia Carney said she found it impossible to talk about her husband’s death and felt numb. She said: 'I don’t feel anything, I’ve lost everything. I don’t feel I can be happy anymore, I feel I’m constantly putting on an act and a brave face for my family. Mrs Carney added: 'He used to love going for an early morning walk. He thought he was safe, but a chance encounter ended his life.' She said she had been with Mr Carney from a young age and although they had been living separately for a few years, they were 'still very much together'. Mrs Carney said she could no longer go into town because it was 'too painful' to be near the spot where her husband was murdered. Mr Nouri, 31, said that since the attack, he did not 'trust anyone or anything' and 'all thoughts and feelings I had of being in a safe country have gone'. His victim statement added: 'I would expect to be arrested and killed in my home country for converting to Christianity but I did not expect to be attacked in my sleep here. How is it possible for someone to destroy someone's life because of his religion?' Mr Nouri said he now struggled with mental health problems and had to move cities, losing all his friends. 'I want to tell Ahmed: You are a weak person, because of your religion you attack someone in deep sleep and an old man who struggled to walk,' he added. As the statements were read out in court, Alid sat in the dock with three security guards and repeatedly yawned. Det Ch Supt James Dunkerley from Terrorism Policing North East (TPNE) described the attack as a 'violent rampage'. 'He was telling everybody on arrest, and in custody, what his intentions were – that he wanted to go out and kill more people,” he said. 'He was hell-bent on violence that day. His extremist views had fuelled him so much that he wanted to cause harm to anybody he could, in retribution to what he was seeing on his online media on events happening in Gaza.' Meanwhile a refugee organisation said sanctuary seekers in the area were 'scared to go out' because they feared backlash against the attack. Tees Valley of Sanctuary co-chair Shams Moussa said at the time, some refugees and asylum seekers deliberately did not go to things like appointments, food shops or volunteering commitments because they were 'afraid they would be targeted'."
    },
    {
      "data": "BRUSSELS — A shooter killed two Swedish football supporters near the center of Brussels Monday evening, in what senior Belgian officials have condemned as a “brutal terrorist attack.” A man believed to be the suspect was shot by Brussels police on Tuesdaymorning. In a press conference at 5 a.m. local time Tuesday morning, Belgian Prime Minister Alexander De Croo said the suspect was “a man of Tunisian origin” who “was staying illegally in our country.” De Croo said the shooter “targeted specifically Swedish football supporters,” and that a full investigation into the “brutal terrorist attack” is underway. Sweden was playing Belgium in a football match at the national stadium in northern Brussels, with hundreds of supporters following their team. The game was abandoned. Sweden has been on the front line of blowback from hard-line Islamists, due to repeated Quran burnings — including a spate this summer which led Stockholm to increase the country’s security threat level. Heightened security measures will be implemented in sensitive locations in Belgium, particularly those associated with the Swedish community, De Croo said. Belgium’s authorities said a suspect fired gunshots near Place Sainctelette and Boulevard du Neuvième de Ligne shortly after 7 p.m., with police immediately dispatched to the scene. A third person — a cab driver — was also injured by gunfire, and is currently recovering from “severe injuries,” De Croo said Tuesday. A meeting of the National Security Council will be held at 3 p.m. Tuesday, the prime minister said. “More than ever, it is peace that must guide us, acting as an antidote to terror,” De Croo said in his press conference. “Let’s keep our very Belgian attitude and, above all, let’s remain united in the face of this terrible attack.” Late Monday night, Eric van Duyse, spokesperson for the federal prosecutor’s office, said on Belgian TV: “During the evening, a statement was posted on social networks and recorded by a person claiming to be the assailant. He claimed to be inspired by the Islamic State [ISIS]. “In the same statement, the victims’ Swedish nationality was mentioned as a probable motive for the act. At this stage, there is no evidence of any connection with the Israeli-Palestinian situation,” van Duyse added, referring to the ongoing war between Israel and Hamas. According to Belgian public broadcaster RTBF, police in the early hours of Tuesday were carrying out raids in municipality of Schaerbeek, where the suspected gunman was reportedly living. Belgian media have identified the suspect as a 45-year-old man known as Abdesalem L., who has Tunisian origins. European and some Flemish schools will be closed in the capital on Tuesday, the education minister of the French-speaking Community of Belgium, told RTBF. French schools will remain open. Sweden-Belgium football match abandoned Brussels raised its terror threat level to four, the maximum on the scale, according to the Belgian National Crisis Center. The organization asked people to avoid unnecessary travel and show “increased vigilance.” Belgian’s Foreign Minister Hadja Lahbib said she was “horrified” by the “terrorist attack,” adding, “All necessary means must be mobilized to combat radicalism.” In a statement regarding the game, European football’s governing body, UEFA, said, “Following a suspected terrorist attack in Brussels this evening, it has been decided, after consultation with the two teams and the local police authorities, that the UEFA Euro 2024 qualifying match between Belgium and Sweden is abandoned.” France toughens border controls Tobias Billström, Sweden’s foreign minister, said Monday: “Devastated by the news of two Swedish football supporters murdered in Brussels tonight and a third person being seriously wounded. All my thoughts are with their families and loved ones.” Reaction has come in from EU leaders, too. French President Emmanuel Macron said “Our Europe is shaken,” while Italian Prime Minister Giorgia Meloni said, “Italy strongly condemns all forms of violence, fanaticism and terrorism and expresses its deepest condolences to the victims and their families.” Following the attack, French Interior Minister Gérald Darmanin announced France would strengthen its border controls with Belgium, according to AFP. Belgium’s Interior Minister Annelies Verlinden, Justice Minister Vincent Van Quickenborne and De Croo were at the National Crisis Center, near the prime minister’s office in the Belgian capital, on Monday night. Brussels Mayor Philippe Close said: “Following the shooting in Brussels, the police services are mobilizing to guarantee safety in and around our capital” in collaboration with Verlinden’s ministry. European Parliament President Roberta Metsola said: “Terror and extremism cannot infiltrate in our societies. People must feel safe. Hate will not win.”"
    },
    {
      "data": "A KNIFEMAN has been shot and reportedly killed by cops after a stabbing rampage at an anti-Islam rally in southwest Germany One of his victims, German far-right firebrand Michael Stürzenberger, is said to be undergoing surgery for stab wounds to his leg and face. The horror ordeal unfolded at a gathering in Mannheim for the BPE political group, which is known to hold anti-Islam views, and was live-streamed to thousands on YouTube on Friday morning. Footage shows the moment the attacker also stabbed a police officer - and at least one other person was injured in the rampage. Islam critic Michael Stürzenberger, 59, had been taking part in a rally organised by German counter-jihad group \"Citizens' Movement PAX Europa\" when he was attacked and \"seriously\" injured. Shocking footage showed a bearded man armed with a large knife lunging at Stürzenberger before they both tumbled to the floor. The rampaging knifeman repeatedly stabbed Stürzenberger in the face, neck, and chest area. Other men dressed in blue, who also appeared to have taken part in the rally, attempted to pull the attacker from his victim. Stürzenberger appeared to have been stabbed in his leg and face. Blood spilled from a hole in his jeans and dripped near his eyes. A policeman tripped in the chaos and was crouched over when the knifeman lunged towards him and stabbed him in the back and side. Another officer pointed a gun at the attacker, who fell to the ground as a shot rang out in the Mannheim market square. The knifeman rolled onto his back, laid still, and died, Bild reports. Cops are yet to confirm whether the attacker died after he was shot. German interior minister Nancy Faeser said on Friday afternoon: \"The investigation will clarify the background to this crime. If the investigation reveals an Islamist motive, then that would be further confirmation of the great danger posed by Islamist acts of violence that we have warned about.\" Stefanie Kizina, treasurer of the BPE group, earlier told Bild: \"This was not an attack, but an act of terror. The attack happened before the event even started, it must have been planned well in advance.\" The knifeman is believed to have been specifically targeting Stürzenberger, a far-right activist and the leader of the German Freedom Party from 2013 to 2016. Ms Kizina said on Friday afternoon that Stürzenberger was stabbed in the leg and face and was undergoing emergency surgery. She added: \"His life is apparently not in danger. This is the second serious attack on him.\" Stürzenberger was reportedly punched in the face by a Muslim person in Bonn in 2022. Mannheim Police said: \"According to current information, an attack on several people took place today at around 11:35 a.m. on the market square in Mannheim. One person is said to have attacked several people with a knife and injured them. No information can be given yet about the extent and severity of the injuries. A firearm was then used against the attacker. The attacker was also injured as a result.\" The police added: \"Rescue and emergency services as well as the rescue helicopter are in action. There is no danger to the public. Rail traffic between the Kurpfalzkreisel and Paradeplatz is closed until further notice.\" The YouTube video is now unavailable for public viewing. Minutes after the \"deadly\" attack, forensic investigators, masked special forces, and state criminal police officers arrived on scene. Islam critic Stürzenberger is a former media spokesman for the Munich CSU, an avowed critic of Islam and a member of the Pax Europa organisation, according to the citizens' movement's website. Pax Europa said today: \"Terrible news from Mannheim. At today's rally of the citizens' movement Pax Europa in Mannheim, Michael Stürzenberger, several BPE helpers and a policeman were stabbed by an attacker with a knife at around 11:30am. The bearded man was quickly overpowered by the police. The victims suffered severe injuries from the stab wounds.\" Stürzenberger was monitored by state officials from 2013 to 2022 for comparing Islam with fascism, and has been convicted for incitement and denigration of religious teachings. The far-right activist is also the author of an anti-Islam blog and became known in Germany through a citizens' petition against the construction of a mosque in Munich. Today's brutal attack comes just two weeks before the Euros kick-off, and 50 miles south of Frankfurt - where England will play Denmark on June 20. Police and security chiefs across Germany are on high terrorist alert amid threats to next month's tournament from Islamists, the Far Right and pro-Russian factions."
    },
    {
      "data": "The Inspector General of Police, Kayode Egbetokun, has filed a three-count terrorism charge against two suspected terrorists, Jude Iheme and Chika Madukwe, who allegedly kidnapped and killed the traditional ruler of Amanze Obowo Autonomous Community of Imo State, Eze Basil Njoku. They were said to have killed the traditional ruler on December 17, 2022, after kidnapping and collecting a ransom of N4 million cash from his family. In the charge, Iheme and Madukwe alongside others said to be at large, were said to have conspired to commit felony to wit, acts of terrorism contrary to section 26 of the Terrorism Prevention and Prohibition Act 2022. They were also said to have armed themselves with guns and offensive weapons, attacked, kidnapped and killed the monarch on December 17, 2022. The IGP also accused them of failing to volunteer information at their disposal to security agencies which could have led to apprehension of other kidnappers, contrary to section 16 of the same Terrorism Act. When the charges were read to them before Justice Binta Nyako, they pleaded not guilty. A Senior Advocate of Nigeria, Simon Lough who led the prosecution for the Inspector General of Police, told the court that the Police has amended the charges following the arrest of more suspects by operatives. He requested for a date for the other suspects to be brought to court to take plea in the amended charges. Justice Binta Nyako granted the request and fixed March 12 for the fresh arraignment. The judge ordered that the two defendants be remanded at Kuje Prison in Abuja and be returned to court on the adjourned date."
    },
    {
      "data": "A 19-year-old man has been given life with a minimum term of six years for planning to stab police and soldiers. Police believe Matthew King, who converted to extreme Islamism during lockdown, could have been hours away from carrying out an attack when they arrested him. King will serve a discretionary life sentence of a minimum of six years, minus the 367 days he spent on remand. The judge praised King's mother for reporting her suspicions to police. In January this year, King pleaded guilty at the Old Bailey to the preparation of terrorist acts between December 2021 and 17 May 2022. Sentencing him on Friday, Judge Mark Lucraft KC said: \"When it comes to the minimum term that you will serve, I make it plain that I am not ordering that you are to be released at the end of it. Whether you will be released or not at that stage or at any later stage will be a matter for the parole board to consider only when the minimum term has been served.\" Judge Lucraft warned King that if he was released he would remain on licence and liable to recall for the rest of his life. \"In my judgement you are someone where there is a significant risk to members of the public or serious harm,\" the judge told King. 'Extremist Islamist' Police believe King turned from being a \"troubled young man\" to a potential \"self-initiated terrorist\" while stuck at home during the Covid-19 lockdowns. Cdr Dominic Murphy, the Met's head of counter-terrorism, told journalists that King \"held really extreme anti-Western views, he had an extremist Islamist mindset and he was intending to carry out a terrorist attack either here or abroad\". \"It was imminent,\" Cdr Murphy said. Prosecuting barrister Paul Jarvis told the court King had dabbled in drugs since early secondary school, was expelled and left education at 16 with no qualifications. He converted to Islam in 2020 and, at first, his behaviour improved, but in 2021 he began criticising his sisters' clothing as immodest. His mother contacted the government anti-extremism agency, Prevent, because she feared the videos he was watching promoted hatred. Officers from the Metropolitan Police arrested King at his home at Wickford in Essex on 18 May last year. Examination of his phone revealed evidence of him viewing extremist videos which officers believe had convinced him he should kill or torture a British soldier either in the UK or abroad. The phone also showed he had joined an online chat group where he discussed terrorist funding and travel routes to Syria. He had changed his WhatsApp status to \"kill non-Muslims\" and recorded himself rapping to his own lyrics about fellow terrorists in Belmarsh Prison and detonating a bomb, officers found. In 2022, in the weeks before his arrest, King began carrying out reconnaissance in east London, including on police officers patrolling outside Stratford railway station, as well as at Stratford police station and magistrates' court. Mr Jarvis told the court that among videos found on his phone was one near the police station, overlaid with a soundtrack including the words: \"Coldly kill them with hate and rage. Plan your perfect killing spree.\" On 17 May 2022, a CCTV camera had captured him filming after dark outside the 7 Rifles army barracks in east London. He had also purchased military goggles and gloves, and carried a balaclava and a \"shihada\" jihadist flag, sometimes wearing combat clothing to the mosque. Several of the mosques he attended warned him several times about his behaviour, and one decided he was no longer welcome, Mr Jarvis told the court. Members of the public who called the police about King included members of two WhatsApp groups he had joined called Southend Brothers and Southend Shurah. King was put under surveillance, and his social media posts of police officers, captioned with the words \"Target Acquired\", heightened concerns at how fast he appeared to be moving towards an attack. These concerns led to his arrest. Evidence of King's efforts to buy a hunting knife online helped police build the case against him - he had to give passport details to prove his age, under new rules brought in since 2019. Although King never bought a weapon, police say he would have easily been able to obtain a kitchen knife to carry out attacks, though potential terrorists often prefer bigger hunting knives for their shock factor. Officers also obtained Snapchat messages King sent to a girl who was still in the sixth form, in which he said he wanted to travel to Syria to become a martyr. They exchanged messages about how they would like to mutilate members of the British and American armed forces. Miss A wrote to him: \"We can't let them die quick tho. Slow painful death akhi... I'll guide you through it. Or bring him or her home.\" He said he was \"training for Jihad\" and just wanted \"to kill people\". Mr Jarvis told the court that on 17 May 2022, the day before King's arrest, the girl messaged him to say she wanted to concentrate on her exams. King replied he would \"be worshipping Allah\" and he might soon be \"on the news\"."
    },
    {
      "data": "The firebombing of a migrant centre in Dover had “an extreme rightwing motivation”, police have said. Andrew Leak, 66, from High Wycombe in Buckinghamshire, is believed to have killed himself after throwing two or three “crude” incendiary devices at the Western Jet Foil site in Kent last Sunday. Counter Terrorism Policing South East (CTPSE) said on Saturday that evidence had been recovered that indicated the attack “was motivated by a terrorist ideology”. “A number of significant witnesses have been spoken to during the course of the investigation and a number of items of interest have been recovered, including digital media devices,” a statement said. “Evidence from examining these items suggests there was an extreme rightwing motivation behind the attack.” Police said there was no evidence that Leak was working with anyone else or that there was any wider threat to the public. Tim Jacques, the senior national coordinator for Counter Terrorism Policing, said: “Increasingly in counter-terrorism casework, across all ideologies, we are seeing individuals who have mental health concerns and a hateful mindset. “Assessing when this crosses the terrorism threshold is a complex process and needs to be carefully considered on a case-by-case basis. These decisions need to be determined by the facts, as far as they can be established at any given time. “After considering the evidence collected so far in this case, whilst there are strong indications that mental health was likely a factor, I am satisfied that the suspect’s actions were primarily driven by an extremist ideology. This meets the threshold for a terrorist incident.” The shadow home secretary, Yvette Cooper, tweeted: “Very serious that far right extremism drove this attack. I remain concerned that it took so long for counter-terror police to take lead on this case – something I urged home secretary to pursue on Monday. There must be highest vigilance on potential terror or extremist attacks.” Facebook posts on a now-deleted account under the name of an Andy Leak from High Wycombe contain anti-Muslim sentiments. One, shared on 9 August, said: “The next time the job centre sanctions your money for not looking for enough work ask them about the thousands of people getting benefits cannot speak English and can not write English, how are they looking for work? “You can clearly not look for work if you cannot read English or speak English, they are breaking the law, time to stand up.” Two members of staff at the centre were left with minor injuries after police were called at 11.22am last Sunday. Following the incident, 700 people were moved to Manston asylum processing centre near Ramsgate for safety reasons. An inquest into Leak’s death is expected to be opened at Maidstone County Hall on Tuesday."
    },
    {
      "data": "A 42-year-old man has been arrested and charged with murder, attempted murder and terrorist acts after a shooting in the centre of Norway's capital, Oslo. Two people died and 21 were wounded early on Saturday in what police called an \"act of Islamist terrorism\". The shootings were in and near the London Pub, a popular LGBTQ+ venue, the Herr Nilsen jazz club and another pub. Norway's prime minister told the BBC the suspect was questioned in May, but was not deemed a threat at the time. \"We now need to see the result of an investigation,\" PM Jonas Gahr Stoere told the BBC's Newshour programme late on Saturday. The shooting started at about 01:15 local time on Saturday (23:15 GMT Friday), officials said. Eyewitnesses said the suspect took out a gun from his bag and started firing, forcing terrified people to either throw themselves to the ground or flee. The attacker was arrested by police officers - who were helped by bystanders - minutes later. Two weapons were retrieved at the crime scene by police, one of them a fully automatic gun. The authorities later said the suspect was a Norwegian national. Of the 21 injured, 10 were in a serious condition. The terror alert level in Norway has now been raised to its highest level, though the country's PST intelligence service said it currently had \"no indication\" further attacks were likely. Oslo's annual gay Pride parade was due to be held on Saturday, and was formally cancelled on police advice. But despite that, hundreds of people marched near the scene later in the day, shouting: \"We're here, we're queer, we won't disappear!\" \"I think it's fantastic that this march is taking place, otherwise he would have won,\" one woman in her 50s told AFP news agency. Rainbow flags and flowers were laid near the scene of the attack, which was sealed off by police tape, and bystanders comforted each other with hugs. The gunman was known to security services since 2015 as a \"suspected radicalised Islamist\", and had a history of mental illness, Norway's PST intelligence service said. \"There is reason to think that this may be a hate crime,\" police said earlier. \"We are investigating whether... Pride was a target in itself or whether there are other motives.\" King Harald, Norway's monarch, said he and his family were \"horrified\" by the violence. He said \"we must stand together\" to defend \"freedom, diversity and respect for each other\". EU Commission President Ursula von der Leyen tweeted that she was \"shocked by the heinous attack on innocent people\", while French President Emmanuel Macron said: \"We stand stronger against hate if we stand together.\" In the US, John Kirby, a spokesman for the White House's National Security Council, said: \"We're all horrified by the mass shooting in Oslo today targeting the LGBTQI+ community there and our hearts obviously go out to the all the families of the victims, the people of Norway, which is a tremendous ally, and of course the LGBTQI+ community there and around the world,\" Witnesses who were at the London Pub have told how they fled to the basement, where 80 to 100 terrified partygoers were trying to hide. Bili Blum-Jansen told TV2: \"Many called their partners and family, it felt almost as if they were saying goodbye. Others helped calm down those who were extremely terrified.\" Another survivor told how he was hit by flying glass. \"I just noticed that a shot was fired, and I was hit by a shard of glass. There were more and more and more shots, so I escaped into the inner bar and tried to get as many as possible with me,\" he told Norway's public broadcaster NRK. \"I saw a man arrive with a bag, he picked up a gun and started to shoot,\" said journalist Olav Roenneberg of public broadcaster NRK, who was in the area at the time. A woman told the Verdens Gang newspaper that the gunman had taken careful aim at his targets. \"When I understood that it was serious, I ran. There was a man covered in blood motionless on the floor,\" she said. Another man told the newspaper he had seen a lot of people on the ground with head wounds."
    },
    {
      "data": "A man cleared of being a terrorist threat by an official anti-radicalisation programme may spend the rest of his life in jail for the assassination of the Conservative MP Sir David Amess. Ali Harbi Ali, 26, stabbed Amess to death on 15 October 2021, fuelled by Islamic State propaganda and having spent at least two years researching which MP to murder. Ali was being radicalised in 2014 at the same time as he was going through the Prevent anti-radicalisation scheme. The Guardian understands that in 2015, while Ali was becoming an adherent of terrorist violence, Prevent concluded he did not pose a significant danger and his case was closed. Amess died barely an hour after the attack at a church in Leigh-on-Sea, Essex, where he had been holding an advice surgery for those from his Southend West constituency. He was the second MP in just over five years to be murdered by a terrorist; in 2016, an extreme rightwing attacker assassinated the Labour MP Jo Cox. Her widow, Brendan Cox, said after Ali’s conviction: “The terrorist will rot in jail and die in ignominy. David’s name will be remembered, especially by the people of Southend whom he served. “Terrorists may cite different ideologies, but what unites them is their desire for infamy, their cowardly attacks on the unarmed and the total failure to advance their cause. All of my thoughts and love are with David’s family today.” Ali, who had once dreamed of being a doctor, was arrested at the scene, having posed as a constituent to gain an appointment. He told police after his arrest that he supported IS and that he had picked Amess, whose constituency surgery details, including location and time were advertised online. Amess, 69, was stabbed 21 times and died in the church before paramedics could get him to hospital. After 18 minutes of deliberation, the jury at the Old Bailey in central London convicted Ali of the murder of Amess and planning other attacks against MPs. He refused to stand as the unanimous verdicts were delivered. Ali, from Kentish Town, north London, took a train to Essex and booked an appointment at the constituency surgery with the sole aim of killing Amess. He lied to Amess’s aides that he had recently moved to Essex. Once in the room with Amess, Ali received a call, said sorry, stood up and pulled a knife from his pocket and began a frenzied knife attack. As Amess lay dying, Ali sent a note from his phone apparently justifying his actions to his WhatsApp contacts and stayed in the church. He did not try to attack anyone else, despite ample time and opportunity. A man who entered the church just after the stabbing saw Ali standing and holding a knife in his right hand, saying: “I want to kill David. I want them all to die.” Ali was on the phone and the witness could hear a female voice saying, “What have you done?” to which Ali replied that he had done it because of Syria and that he wanted to be shot and killed. The man asked Ali why he had done it and he replied: “I wanted to kill David and every MP who voted for bombings in Syria. I wanted to die, be shot and be a hero.” After his arrest Ali told police he had wanted officers to shoot him and had rushed towards them. Instead, once he realised that the first officers on the scene were unarmed, he had heeded their command to drop his knife. He had planned an attack for two years, since May 2019, supposedly angered by western actions in Syria. He had carried out reconnaissance on other MPs, even scouting the home of Michael Gove. He loitered around the Houses of Parliament on several occasions, looking for a chance to strike. Counter-terrorism officials believe he acted alone. Ali had visited the north London constituency office of Mike Freer MP and had been spotted peering in through a window. Searches of his electronic devices showed research on MPs including Dominic Raab; the Labour leader, Sir Keir Starmer; and Ben Wallace. Amess’s killing caused shock and outrage as well as a review of MPs’ security. He was known as a diligent constituency MP with 38 years in parliament. The jury was told the murder was “an attack on democracy”. The issue of whether the level of danger Ali posed was properly assessed may be an issue for the inquest into Amess’s death, expected at a future date. Once Ali was referred to Prevent, he was assessed as being of sufficient concern that he was seen by the Channel programme – reserved for those at greatest risk of radicalisation. Police and security sources have given little detail about his Prevent involvement, which was first revealed by the Guardian. Each year a small proportion of the thousands referred to Prevent are referred on to the Channel programme for more intensive support. DCS Dominic Murphy said after the verdicts: “He spent some time in Prevent and then came out of Prevent and by his own admission carried on his activity in secret over many years, forming his plan and conducting reconnaissance and focusing his efforts on many MPs.” A government-commissioned review of Prevent is expected to be published this month or next. Ali will be sentenced on Wednesday and the crown may ask the court to impose a whole-life tariff, meaning he will never be released. Mr Justice Sweeney said the jury had faced harrowing evidence and excused them from jury duty for a decade, adding: “This is the sort of case none of us will ever forget.”"
    },
    {
      "data": "The gunman who killed 10 people and wounded three in May in a racist attack at a grocery store in a predominantly Black neighborhood of Buffalo, New York, pleaded guilty Monday to state charges of domestic terrorism as a hate crime, murder and attempted murder. Payton Gendron, a 19-year-old White man, pleaded guilty to one count of domestic act of terrorism motivated by hate, 10 counts of first-degree murder, three counts of attempted murder and a weapons possession charge in the mass shooting at Tops Friendly Markets on May 14. The charges come with a mandatory sentence of life in prison without the chance of parole. Gendron wore a red jumpsuit and had his hands cuffed in front of him in court Monday. He answered “yes” or “no” to several questions affirming he understood why he was pleading guilty and, on the individual counts, said the word “guilty.” He showed no emotion during the hearing. The guilty plea ensures there will be no state trial and Gendron will not appeal, defense attorney Brian Parker said afterward. “This critical step represents a condemnation of the racist ideology that fueled his horrific actions on May 14. Before he is sentenced to life without the possibility of parole on February 15, the surviving victims and deceased victims’ family members will all have a chance to address the court, the community and our client directly,” he said. “It is our hope that a final resolution of the state charges will help in some small way to keep the focus on the needs of the victims and the community.” Gendron’s parents said they remain shocked and shattered over the shooting. “Our hearts are broken over the devastation he caused to the innocent victims he killed and wounded, their families, and the African-American community in Buffalo and beyond,” said Paul and Pamela Gendron in a statement. “With today’s plea of guilty, he will be held accountable for his actions.” “We are thankful to the law-enforcement professionals who investigated this case and will continue to provide any assistance we can. We pray for healing for everyone affected.” Erie County District Attorney John Flynn described the attack as a racist hate crime and outlined the timeline of the mass killing. “In just over two minutes the defendant, with the intent to murder as many African Americans as he could, killed 10 innocent Black people and attempted to kill three others,” Flynn said in a news conference after the hearing. The guilty plea comes six months after Gendron used an illegally modified semiautomatic rifle to carry out the mass shooting. Flynn said he got a letter from the defense a few weeks ago saying the defendant was willing to plead guilty. The victims, including customers, employees and an armed security guard, ranged in age from 20 to 86. Eleven of the 13 people shot were Black and two were White, officials said. Social media posts and a lengthy document written by the gunman reveal he had been planning his attack for months and had visited the Tops supermarket several times previously. He posted that he chose Tops because it was in a particular ZIP code in Buffalo that had the highest percentage of Black people close enough to where he lived in Conklin, New York. The document outlined his goals for the attack, according to Flynn: “To kill as many African Americans as possible, avoid dying and spread ideals.” Gendron also faces multiple federal hate crime charges, which carry the potential for the death penalty, in addition to several firearms charges. He has pleaded not guilty to the federal charges. Flynn on Monday outside court laid out the evidence against Gendron, which was primarily based on surveillance video from the Tops supermarket and from a camera attached to Gendron’s helmet that was live-streaming the attack. Gendron arrived to the grocery store with a modified semiautomatic rifle and targeted people because they were Black, Flynn said. At one point, Gendron pointed his rifle at a White man but did not kill him and said “sorry” because the man was White, “thus further demonstrating the defendant’s racially motivated attack,” Flynn said. Gendron shot four people outside the grocery store and nine more inside before surrendering to Buffalo Police officers who responded to the scene, according to the indictment. New York Gov. Kathy Hochul said following the attack that the AR-15 style rifle used in the shooting was legally purchased in New York State, but was modified with a high-capacity magazine, which is not legal in the state. The state charge of terrorism motivated by hate, passed in 2020, had never been used before in New York. “No individual in the history of the state of New York has been found guilty of domestic terrorism charge motivated by hate until today,” he said. He made the case that the gunman had not achieved his goals. “This racist murderer did not fulfill what he set out to accomplish. He failed. He failed miserably because today this city, this community, is stronger and better than it ever was, and we have shown the world that racism has no part in our community.” Several families of the victims spoke alongside attorney Ben Crump on Monday and took issue with what they described as the legal system’s overly sympathetic treatment of the gunman. “I was angry how the judge was constantly talking to this (suspect) like he was a little prepubescent sixth grade boy,” said Mark Talley, 33, the son of Geraldine Talley. “I was angry that they didn’t have him look at the family of the victims’ faces that he scarred for life.” Zeneta Everhart, whose son Zaire Goodman was shot in the neck but survived, said the gunman’s voice in court sounded “nonchalant.” “His voice made me feel sick,” she said. “This country is inherently violent. It is inherently racist, and his voice showed me that because he didn’t care. You could hear it in that voice. He didn’t care.” Crump said that Gendron – despite his expected life sentence – appeared to have achieved his goals: to kill as many Black people as he could, to survive, and to get mass attention for his 180-page document. “Even though I know this is a step in the right direction in our journey for justice, it still is very painful that the goals that he had set out for, he seems to be accomplishing,” he said. Terrence Connors, who represents the families of seven people who were killed in the shooting and two who were injured, spoke to CNN previously about the suspect’s plan to plead guilty. “This is a remarkable group of families that I speak for,” he said. “The tragedy is still heavy in their hearts, but they’ve turned this nightmare into positive action. From their standpoint, he has become irrelevant to their lives. Their lives have become about making something positive from this horrible tragedy.”"
    },
    {
      "data": "Four Israelis were killed and two others wounded Tuesday in a ramming and stabbing attack at an outdoor shopping mall in Beersheba officials said, in Israel’s deadliest terror attack in years. According to police, the assailant first stabbed a woman to death at a gas station in the southern city. He then entered his car and rammed a cyclist, before getting out again and stabbing several people at the BIG shopping center. The terrorist was confronted by an armed bus driver, who attempted to get him to lower his weapon, footage from the scene showed. The attacker lunged at the driver, who shot him alongside a second armed Israeli civilian. First responders reported that the stabber died from the gunshot wounds. Police commissioner Kobi Shabtai said the entire incident lasted eight minutes, with police officers arriving at the scene four minutes after being alerted. “Citizens displayed resourcefulness and killed the terrorist in the initial minutes,” he said. Magen David Adom medics reported that a 40-year-old Israeli woman died on the scene after being stabbed. Five other victims of the attack were rushed to Soroka Medical Center, where the cyclist and two of the stabbing victims died of their wounds. The two remaining wounded women were initially listed in serious condition, but were later downgraded to moderate and stable. The four fatalities were later named as Doris Yahbas, 49, a mother of three, Laura Yitzhak, 43, another mother of three, Rabbi Moshe Kravitzky, a father of four, and Menahem Yehezkel, 67. Palestinian media identified the stabber as 34-year-old Mohammad Ghaleb Abu al-Qi’an, a terror convict from the Bedouin town of Hura in the Negev. Abu al-Qi’an, who died of his wounds on the scene, had served four years in prison for plotting to join the fundamentalist Islamic State terror group in Syria. He was released in 2019. Shabtai said he likely acted alone in Tuesday’s attack. Tuesday’s rampage was the deadliest attack on Israeli civilians since June 2016, when two terrorists opened fire at Tel Aviv’s Sarona Market, killing four people and wounding 16. The Hamas terror group praised the stabbing attack, saying it “salutes the executor of the heroic operation in occupied Beersheba.” The terror group did not claim the stabber as a member, however. “The occupation’s crimes shall be met with heroic operations: stabbings, rammings and shootings,” Hamas spokesperson Abd al-Latif al-Qanou told official Hamas radio. The bus driver who confronted and shot the terrorist later recounted trying to talk the stabber down before shooting him. Arthur Chaimov told Channel 12 he’d arrived at a traffic circle near the BIG shopping center, and first thought there had been a car accident. But when he saw a man running around seemingly brandishing a knife, he got out of the bus with his personal weapon. “I got closer and then I saw he had a knife. I saw a man [lying] wounded. I told [the stabber] several times: ‘I’m asking you to put down the knife. I won’t shoot you. He said ‘No.’” Al-Qi’an lunged at him several times, with Chaimov moving back each time, as seen in a video of the incident. Eventually, the assailant got too close and Chaimov, sensing danger, fired his weapon. Chaimov stressed he’d done all he could to avoid shooting the terrorist and was pained to have done so, despite al-Qi’an’s murderous actions. “He’s a person, not an animal you need to kill. He was also a person… We’re human beings, we’re not animals,” Chaimov said. “I’m not used to such a situation, to shoot a person. I’m sorry for him but he brought it on himself.” Speaking from the scene of the stabbing, Shabtai said cops were being put on high alert out of fear of copycat attacks. The police chief also said police and Shin Bet investigators were checking whether the attacker had help, but think he acted alone. “This terrorist carried out a murderous heinous rampage, ramming people and stabbing them. We haven’t confronted something on this scale in some time,” Shabtai said. “We have bolstered national preparedness out of concern for copycat attacks.” Video showed a number of people yelling “shame” as Shabtai spoke, apparently in protest of the police response. The attack comes amid a string of attacks in Jerusalem and the West Bank. On Sunday, two officers were hurt in a suspected stabbing attack in East Jerusalem’s Ras al-Amud neighborhood, and on Saturday, an Israeli man was stabbed and lightly hurt when he was out jogging on Jerusalem’s Hebron Road. Earlier this month there were several attacks in Jerusalem’s Old City, and in a nearby West Bank town. Tensions have between Israel and the Palestinians in recent weeks across the West Bank and East Jerusalem. Ten Palestinians were killed in violent confrontations with Israeli troops: some died in gun battles with Israeli soldiers in the West Bank, while others during attempted attacks. Defense Minister Benny Gantz offered his condolences to the victims’ families. “The IDF and security forces will use all means to prevent terrorist incidents, as much as possible. We are on high alert against all threats in all areas,” Gantz said. “We will make sure that anyone who encourages or supports the latest attacks, will pay a price,” Gantz added during a tour of the military’s northern command. Arab Israeli parties condemned the attack. Both the Islamist Ra’am party – which is a member of the coalition government — and the opposition Joint List party used the word “pigua,” which is widely used in Hebrew to describe any nationalistic attack, but which strongly implies terrorism. “Ra’am condemns this despicable attack in Beersheba and sends its condolences to the families of those murdered,” Ra’am said in statement. “Ra’am calls on all citizens to preserve the common, fragile social fabric, to be responsible and advance a discourse of tolerance in this difficult hour,” Ra’am added. Joint List chief Ayman Odeh said he was shocked by the stabbing attack, which he deemed a “murderous incident.” “Violence is not our way and we must condemn it with all our might,” Odeh wrote on Twitter."
    }
  ]
}
